Revit 2026 API

# AdvancedWoodWoodEarlywoodSharpness Property

---

The property labeled "Percentage of pure earlywood" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodEarlywoodSharpness { get; }
```
```vb
Public Shared ReadOnly Property WoodEarlywoodSharpness As String
	Get
```
```cpp
public:
static property String^ WoodEarlywoodSharpness {
	String^ get ();
}
```
```fsharp
static member WoodEarlywoodSharpness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace